var rule = {
title: 'eFuns影视',
host: 'https://www.pili5.cn',
hostJs: '',
headers: {'User-Agent': 'MOBILE_UA'},
编码: 'utf-8',
timeout: 5000,
homeUrl: '/',
url: '/index.php/vod/show/fyfilter.html',
filter_url: '{{fl.area}}{{fl.by}}{{fl.class}}{{fl.cateId}}/page/fypage{{fl.year}}',
searchUrl: '/index.php/vod/search/page/fypage/wd/**.html',
searchable: 1, quickSearch: 1, filterable: 1,
class_name: '短剧',
class_url: '5',
filter_def: {
1: {cateId: '/id/1'},2:{cateId: '/id/2'},3: {cateId: '/id/3'},4: {cateId: '/id/4'},5: {cateId: '/id/5'}
},
play_parse: true,
parse_url: '',
lazy: '',
推荐: '*;*;*;*;*',
一级: '.module-item a;a&&title;img&&data-original;.module-item-note&&Text;a&&href',
二级: {
"title": "h1&&Text;.module-info-tag-link:eq(2)&&Text",
"img": "img&&data-original",
//主要描述;年份;地区;演员;导演
"desc": ".module-info-item-content:eq(3)&&Text;.module-info-tag-link:eq(0)&&Text;.module-info-tag-link:eq(1)&&Text;.module-info-item-content:eq(1)&&Text;.module-info-item-content:eq(0)&&Text",
//简介
"content": ".module-info-introduction-content&&Text",
"tabs": ".tab-item",
"lists": ".module-play-list:eq(#id)&&a",
"list_url": "a&&href"
},
搜索: 'body&&.module-item;img&&alt;img&&data-original;.module-item-note&&Text;a&&href',

filter: {
"1":[
{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/1"},{"n":"动作片","v":"/id/6"},{"n":"喜剧片","v":"/id/7"},{"n":"爱情片","v":"/id/8"},{"n":"科幻片","v":"/id/9"},{"n":"奇幻片","v":"/id/50"},{"n":"恐怖片","v":"/id/10"},{"n":"剧情片","v":"/id/11"},{"n":"战争片","v":"/id/12"},{"n":"犯罪片","v":"/id/26"},{"n":"悬疑片","v":"/id/28"},{"n":"动画电影","v":"/id/27"},{"n":"纪录片","v":"/id/30"}]},
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"喜剧","v":"/class/喜剧"},{"n":"爱情","v":"/class/爱情"},{"n":"恐怖","v":"/class/恐怖"},{"n":"动作","v":"/class/动作"},{"n":"科幻","v":"/class/科幻"},{"n":"剧情","v":"/class/剧情"},{"n":"战争","v":"/class/战争"},{"n":"犯罪","v":"/class/犯罪"},{"n":"动画","v":"/class/动画"},{"n":"奇幻","v":"/class/奇幻"},{"n":"武侠","v":"/class/武侠"},{"n":"冒险","v":"/class/冒险"},{"n":"枪战","v":"/class/枪战"},{"n":"恐怖","v":"/class/恐怖"},{"n":"悬疑","v":"/class/悬疑"},{"n":"惊悚","v":"/class/惊悚"},{"n":"古装","v":"/class/古装"},{"n":"历史","v":"/class/历史"},{"n":"家庭","v":"/class/家庭"},{"n":"同性","v":"/class/同性"},{"n":"运动","v":"/class/运动"},{"n":"儿童","v":"/class/儿童"},{"n":"经典","v":"/class/经典"},{"n":"青春","v":"/class/青春"},{"n":"文艺","v":"/class/文艺"},{"n":"微电影","v":"/class/微电影"},{"n":"纪录片","v":"/class/纪录片"},{"n":"网络电影","v":"/class/网络电影"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/大陆"},{"n":"美国","v":"/area/美国"},{"n":"韩国","v":"/area/韩国"},{"n":"日本","v":"/area/日本"},{"n":"泰国","v":"/area/泰国"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"新加坡","v":"/area/新加坡"},{"n":"印度","v":"/area/印度"},{"n":"英国","v":"/area/英国"},{"n":"法国","v":"/area/法国"},{"n":"德国","v":"/area/德国"},{"n":"加拿大","v":"/area/加拿大"},{"n":"西班牙","v":"/area/西班牙"},{"n":"俄罗斯","v":"/area/俄罗斯"},{"n":"其它","v":"/area/其它"}]},
{"key":"year","name":"时间","value":[{"n":"全部","v":""},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"},{"n":"2003","v":"/year/2003"},{"n":"2002","v":"/year/2002"},{"n":"2001","v":"/year/2001"},{"n":"2000","v":"/year/2000"},{"n":"1999","v":"/year/1999"},{"n":"1998","v":"/year/1998"},{"n":"1997","v":"/year/1997"},{"n":"1996","v":"/year/1996"},{"n":"1995","v":"/year/1995"},{"n":"1994","v":"/year/1994"},{"n":"1993","v":"/year/1993"},{"n":"1992","v":"/year/1992"},{"n":"1991","v":"/year/1991"},{"n":"1990","v":"/year/1990"},{"n":"1989","v":"/year/1989"},{"n":"1988","v":"/year/1988"},{"n":"1987","v":"/year/1987"},{"n":"1986","v":"/year/1986"},{"n":"1985","v":"/year/1985"},{"n":"1984","v":"/year/1984"},{"n":"1983","v":"/year/1983"},{"n":"1982","v":"/year/1982"},{"n":"1981","v":"/year/1981"},{"n":"1980","v":"/year/1980"}]},
{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}
],
"2":[
{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/2"},{"n":"国产剧","v":"/id/13"},{"n":"港剧","v":"/id/14"},{"n":"台剧","v":"/id/15"},{"n":"韩剧","v":"/id/16"},{"n":"日剧","v":"/id/31"},{"n":"欧美剧","v":"/id/32"},{"n":"泰剧","v":"/id/33"},{"n":"其它剧","v":"/id/34"}]},
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"爱情","v":"/class/爱情"},{"n":"言情","v":"/class/言情"},{"n":"都市","v":"/class/都市"},{"n":"家庭","v":"/class/家庭"},{"n":"战争","v":"/class/战争"},{"n":"喜剧","v":"/class/喜剧"},{"n":"古装","v":"/class/古装"},{"n":"武侠","v":"/class/武侠"},{"n":"偶像","v":"/class/青春偶像"},{"n":"历史","v":"/class/历史"},{"n":"悬疑","v":"/class/悬疑"},{"n":"科幻","v":"/class/科幻"},{"n":"冒险","v":"/class/冒险"},{"n":"惊悚","v":"/class/惊悚"},{"n":"犯罪","v":"/class/犯罪"},{"n":"运动","v":"/class/运动"},{"n":"恐怖","v":"/class/恐怖"},{"n":"剧情","v":"/class/剧情"},{"n":"奇幻","v":"/class/奇幻"},{"n":"纪录片","v":"/class/纪录片"},{"n":"灾难","v":"/class/灾难"},{"n":"动作","v":"/class/动作"},{"n":"经典","v":"/class/经典"},{"n":"乡村","v":"/class/乡村"},{"n":"情景","v":"/class/情景"},{"n":"商战","v":"/class/商战"},{"n":"网剧","v":"/class/网剧"},{"n":"其它","v":"/class/其它"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/大陆"},{"n":"美国","v":"/area/美国"},{"n":"韩国","v":"/area/韩国"},{"n":"日本","v":"/area/日本"},{"n":"泰国","v":"/area/泰国"},{"n":"香港","v":"/area/香港"},{"n":"台湾","v":"/area/台湾"},{"n":"新加坡","v":"/area/新加坡"},{"n":"印度","v":"/area/印度"},{"n":"英国","v":"/area/英国"},{"n":"法国","v":"/area/法国"},{"n":"德国","v":"/area/德国"},{"n":"加拿大","v":"/area/加拿大"},{"n":"西班牙","v":"/area/西班牙"},{"n":"俄罗斯","v":"/area/俄罗斯"},{"n":"其它","v":"/area/其它"}]},
{"key":"year","name":"时间","value":[{"n":"全部","v":""},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"},{"n":"2003","v":"/year/2003"},{"n":"2002","v":"/year/2002"},{"n":"2001","v":"/year/2001"},{"n":"2000","v":"/year/2000"},{"n":"1999","v":"/year/1999"},{"n":"1998","v":"/year/1998"},{"n":"1997","v":"/year/1997"},{"n":"1996","v":"/year/1996"},{"n":"1995","v":"/year/1995"},{"n":"1994","v":"/year/1994"},{"n":"1993","v":"/year/1993"},{"n":"1992","v":"/year/1992"},{"n":"1991","v":"/year/1991"},{"n":"1990","v":"/year/1990"},{"n":"1989","v":"/year/1989"},{"n":"1988","v":"/year/1988"},{"n":"1987","v":"/year/1987"},{"n":"1986","v":"/year/1986"},{"n":"1985","v":"/year/1985"},{"n":"1984","v":"/year/1984"},{"n":"1983","v":"/year/1983"},{"n":"1982","v":"/year/1982"},{"n":"1981","v":"/year/1981"},{"n":"1980","v":"/year/1980"}]},
{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}
],
"3":[
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"情感","v":"/class/情感"},{"n":"选秀","v":"/class/选秀"},{"n":"音乐","v":"/class/音乐"},{"n":"访谈","v":"/class/访谈"},{"n":"旅游","v":"/class/旅游"},{"n":"播报","v":"/class/播报"},{"n":"美食","v":"/class/美食"},{"n":"纪实","v":"/class/纪实"},{"n":"曲艺","v":"/class/曲艺"},{"n":"生活","v":"/class/生活"},{"n":"游戏互动","v":"/class/游戏互动"},{"n":"财经","v":"/class/财经"},{"n":"求职","v":"/class/求职"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/内地"},{"n":"欧美","v":"/area/欧美"},{"n":"日韩","v":"/area/日韩"},{"n":"港台","v":"/area/港台"},{"n":"其它","v":"/area/其它"}]},
{"key":"year","name":"时间","value":[{"n":"全部","v":""},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"},{"n":"2003","v":"/year/2003"},{"n":"2002","v":"/year/2002"},{"n":"2001","v":"/year/2001"},{"n":"2000","v":"/year/2000"},{"n":"1990","v":"/year/1990"},{"n":"1980","v":"/year/1980"},{"n":"1970","v":"/year/1970"},{"n":"1960","v":"/year/1960"},{"n":"1950","v":"/year/1950"}]},
{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}
],
"4":[{"key":"cateId","name":"类型","value":[{"n":"全部","v":"/id/4"},{"n":"国产动漫","v":"/id/39"},{"n":"欧美动漫","v":"/id/41"},{"n":"日韩动漫","v":"/id/40"},{"n":"海外动漫","v":"/id/43"},{"n":"港台动漫","v":"/id/42"}]},
{"key":"class","name":"剧情","value":[{"n":"全部","v":""},{"n":"情感","v":"/class/情感"},{"n":"热血","v":"/class/热血"},{"n":"推理","v":"/class/推理"},{"n":"搞笑","v":"/class/搞笑"},{"n":"动作","v":"/class/动作"},{"n":"科幻","v":"/class/科幻"},{"n":"校园","v":"/class/校园"},{"n":"冒险","v":"/class/冒险"},{"n":"萝莉","v":"/class/萝莉"},{"n":"后宫","v":"/class/后宫"},{"n":"机战","v":"/class/机战"},{"n":"运动","v":"/class/运动"},{"n":"机战","v":"/class/机战"},{"n":"战争","v":"/class/战争"},{"n":"少年","v":"/class/少年"},{"n":"少女","v":"/class/少女"},{"n":"原创","v":"/class/原创"},{"n":"亲子","v":"/class/亲子"},{"n":"益智","v":"/class/益智"},{"n":"励志","v":"/class/励志"},{"n":"其他","v":"/class/其他"}]},
{"key":"area","name":"地区","value":[{"n":"全部","v":""},{"n":"大陆","v":"/area/国产"},{"n":"欧美","v":"/area/欧美"},{"n":"日本","v":"/area/日本"},{"n":"其它","v":"/area/其它"}]},
{"key":"year","name":"时间","value":[{"n":"全部","v":""},{"n":"2024","v":"/year/2024"},{"n":"2023","v":"/year/2023"},{"n":"2022","v":"/year/2022"},{"n":"2021","v":"/year/2021"},{"n":"2020","v":"/year/2020"},{"n":"2019","v":"/year/2019"},{"n":"2018","v":"/year/2018"},{"n":"2017","v":"/year/2017"},{"n":"2016","v":"/year/2016"},{"n":"2015","v":"/year/2015"},{"n":"2014","v":"/year/2014"},{"n":"2013","v":"/year/2013"},{"n":"2012","v":"/year/2012"},{"n":"2011","v":"/year/2011"},{"n":"2010","v":"/year/2010"},{"n":"2009","v":"/year/2009"},{"n":"2008","v":"/year/2008"},{"n":"2007","v":"/year/2007"},{"n":"2006","v":"/year/2006"},{"n":"2005","v":"/year/2005"},{"n":"2004","v":"/year/2004"},{"n":"2003","v":"/year/2003"},{"n":"2002","v":"/year/2002"},{"n":"2001","v":"/year/2001"},{"n":"2000","v":"/year/2000"},{"n":"1999","v":"/year/1999"},{"n":"1998","v":"/year/1998"},{"n":"1997","v":"/year/1997"},{"n":"1996","v":"/year/1996"},{"n":"1995","v":"/year/1995"},{"n":"1994","v":"/year/1994"},{"n":"1993","v":"/year/1993"},{"n":"1992","v":"/year/1992"},{"n":"1991","v":"/year/1991"},{"n":"1990","v":"/year/1990"},{"n":"1989","v":"/year/1989"},{"n":"1988","v":"/year/1988"},{"n":"1987","v":"/year/1987"},{"n":"1986","v":"/year/1986"},{"n":"1985","v":"/year/1985"},{"n":"1984","v":"/year/1984"},{"n":"1983","v":"/year/1983"},{"n":"1982","v":"/year/1982"},{"n":"1981","v":"/year/1981"},{"n":"1980","v":"/year/1980"}]},
{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}
],
"5":[
{"key":"by","name":"排序","value":[{"n":"时间","v":"/by/time"},{"n":"人气","v":"/by/hits"},{"n":"评分","v":"/by/score"}]}]}
}